# DataSet 1

In [1]:
import numpy as np
import pandas as pd

In [2]:
a=pd.read_csv(r"E:\Python Data Science\Documents\4_drug200 - 4_drug200.csv")

In [3]:
a

     Age Sex      BP Cholesterol  Na_to_K   Drug
0     23   F    HIGH        HIGH   25.355  drugY
1     47   M     LOW        HIGH   13.093  drugC
2     47   M     LOW        HIGH   10.114  drugC
3     28   F  NORMAL        HIGH    7.798  drugX
4     61   F     LOW        HIGH   18.043  drugY
..   ...  ..     ...         ...      ...    ...
195   56   F     LOW        HIGH   11.567  drugC
196   16   M     LOW        HIGH   12.006  drugC
197   52   M  NORMAL        HIGH    9.894  drugX
198   23   M  NORMAL      NORMAL   14.020  drugX
199   40   F     LOW      NORMAL   11.349  drugX

[200 rows x 6 columns]

In [4]:
b=a[["Age","Na_to_K"]]
b

     Age  Na_to_K
0     23   25.355
1     47   13.093
2     47   10.114
3     28    7.798
4     61   18.043
..   ...      ...
195   56   11.567
196   16   12.006
197   52    9.894
198   23   14.020
199   40   11.349

[200 rows x 2 columns]

In [5]:
b.mean()

Age        44.315000
Na_to_K    16.084485
dtype: float64

In [6]:
b.median()

Age        45.0000
Na_to_K    13.9365
dtype: float64

In [7]:
b.mode()

    Age  Na_to_K
0  47.0   12.006
1   NaN   18.295

In [8]:
b.describe()

              Age     Na_to_K
count  200.000000  200.000000
mean    44.315000   16.084485
std     16.544315    7.223956
min     15.000000    6.269000
25%     31.000000   10.445500
50%     45.000000   13.936500
75%     58.000000   19.380000
max     74.000000   38.247000

In [9]:
b.sum()

Age        8863.000
Na_to_K    3216.897
dtype: float64

In [10]:
b.cumsum()

      Age   Na_to_K
0      23    25.355
1      70    38.448
2     117    48.562
3     145    56.360
4     206    74.403
..    ...       ...
195  8732  3169.628
196  8748  3181.634
197  8800  3191.528
198  8823  3205.548
199  8863  3216.897

[200 rows x 2 columns]

In [11]:
b.count()

Age        200
Na_to_K    200
dtype: int64

In [12]:
b.min()

Age        15.000
Na_to_K     6.269
dtype: float64

In [13]:
b.max()

Age        74.000
Na_to_K    38.247
dtype: float64

In [14]:
from numpy import cov

In [15]:
from scipy.stats import pearsonr
from scipy.stats import spearmanr

In [32]:
data1=b["Age"]
data2=b["Na_to_K"]
print(cov(data1,data2))

[[273.71434673  -7.54375153]
 [ -7.54375153  52.18553348]]

In [33]:
print(spearmanr(data1,data2))

SpearmanrResult(correlation=-0.047273882688479915, pvalue=0.5062200581387418)

In [34]:
print(pearsonr(data1,data2))

(-0.06311949726772592, 0.3745756399034559)

# Dataset 2

In [29]:
c=pd.read_csv(r"E:\Python Data Science\Documents\5_Instagram data - 5_Instagram data.csv")
c

,Impressions,From Home,From Hashtags,From Explore,From Other,Saves,Comments,Shares,Likes,Profile Visits,Follows,Caption,Hashtags
0,3920,2586,1028,619,56,98,9,5,162,35,2,Here are some of the most important data visua...,#finance #money #business #investing #investme...
1,5394,2727,1838,1174,78,194,7,14,224,48,10,Here are some of the best data science project...,#healthcare #health #covid #data #datascience ...
2,4021,2085,1188,0,533,41,11,1,131,62,12,Learn how to train a machine learning model an...,#data #datascience #dataanalysis #dataanalytic...
3,4528,2700,621,932,73,172,10,7,213,23,8,Heres how you can write a Python program to d...,#python #pythonprogramming #pythonprojects #py...
4,2518,1704,255,279,37,96,5,4,123,8,0,Plotting annotations while visualizing your da...,#datavisualization #datascience #data #dataana...
...,...,...,...,...,...,...,...,...,...,...,...,...,...
114,13700,5185,3041,5352,77,573,2,38,373,73,80,Here are some of the best data science certifi...,#datascience #datasciencejobs #datasciencetrai...
115,5731,1923,1368,2266,65,135,4,1,148,20,18,Clustering is a machine learning technique use...,#machinelearning #machinelearningalgorithms #d...
116,4139,1133,1538,1367,33,36,0,1,92,34,10,Clustering music genres is a task of grouping ...,#machinelearning #machinelearningalgorithms #d...
117,32695,11815,3147,17414,170,1095,2,75,549,148,214,Here are some of the best data science certifi...,#datascience #datasciencejobs #datasciencetrai...
118,36919,13473,4176,16444,2547,653,5,26,443,611,228,175 Python Projects with Source Code solved an...,#python #pythonprogramming #pythonprojects #py...

In [30]:
d=c[["From Hashtags","From Explore"]]
d

     From Hashtags  From Explore
0             1028           619
1             1838          1174
2             1188             0
3              621           932
4              255           279
..             ...           ...
114           3041          5352
115           1368          2266
116           1538          1367
117           3147         17414
118           4176         16444

[119 rows x 2 columns]

In [35]:
d.mean()

From Hashtags    1887.512605
From Explore     1078.100840
dtype: float64

In [36]:
d.median()

From Hashtags    1278.0
From Explore      326.0
dtype: float64

In [37]:
d.mode()

    From Hashtags  From Explore
0             116          45.0
1             201          84.0
2             278           NaN
3             362           NaN
4             411           NaN
5             583           NaN
6             655           NaN
7             707           NaN
8             771           NaN
9             794           NaN
10           1248           NaN
11           1260           NaN
12           1278           NaN
13           1693           NaN
14           1938           NaN
15           2351           NaN
16           2975           NaN
17           3450           NaN
18           3551           NaN

In [39]:
d.describe()

       From Hashtags  From Explore
count     119.000000    119.000000
mean     1887.512605   1078.100840
std      1884.361443   2613.026132
min       116.000000      0.000000
25%       726.000000    157.500000
50%      1278.000000    326.000000
75%      2363.500000    689.500000
max     11817.000000  17414.000000

In [40]:
d.sum()

From Hashtags    224614
From Explore     128294
dtype: int64

In [42]:
d.cumsum()

     From Hashtags  From Explore
0             1028           619
1             2866          1793
2             4054          1793
3             4675          2725
4             4930          3004
..             ...           ...
114         214385         90803
115         215753         93069
116         217291         94436
117         220438        111850
118         224614        128294

[119 rows x 2 columns]

In [43]:
d.count()

From Hashtags    119
From Explore     119
dtype: int64

In [44]:
d.min()

From Hashtags    116
From Explore       0
dtype: int64

In [45]:
d.max()

From Hashtags    11817
From Explore     17414
dtype: int64

In [46]:
pd.isna(d)

     From Hashtags  From Explore
0            False         False
1            False         False
2            False         False
3            False         False
4            False         False
..             ...           ...
114          False         False
115          False         False
116          False         False
117          False         False
118          False         False

[119 rows x 2 columns]

In [48]:
d1=d["From Hashtags"]
d2=d["From Explore"]
print(cov(d1,d2))

[[3550818.04856858  937769.88007406]
 [ 937769.88007406 6827905.56601624]]

In [50]:
print(spearmanr(d1,d2))

SpearmanrResult(correlation=0.23560225274688193, pvalue=0.009897021951031822)

In [51]:
print(pearsonr(d1,d2))

(0.19045321897037393, 0.038014382605079576)

# DataSet 3

In [52]:
e=pd.read_csv(r"E:\Python Data Science\Documents\2015.csv")
e

,Country,Region,Happiness Rank,Happiness Score,Standard Error,Economy (GDP per Capita),Family,Health (Life Expectancy),Freedom,Trust (Government Corruption),Generosity,Dystopia Residual
0,Switzerland,Western Europe,1,7.587,0.03411,1.39651,1.34951,0.94143,0.66557,0.41978,0.29678,2.51738
1,Iceland,Western Europe,2,7.561,0.04884,1.30232,1.40223,0.94784,0.62877,0.14145,0.43630,2.70201
2,Denmark,Western Europe,3,7.527,0.03328,1.32548,1.36058,0.87464,0.64938,0.48357,0.34139,2.49204
3,Norway,Western Europe,4,7.522,0.03880,1.45900,1.33095,0.88521,0.66973,0.36503,0.34699,2.46531
4,Canada,North America,5,7.427,0.03553,1.32629,1.32261,0.90563,0.63297,0.32957,0.45811,2.45176
...,...,...,...,...,...,...,...,...,...,...,...,...
153,Rwanda,Sub-Saharan Africa,154,3.465,0.03464,0.22208,0.77370,0.42864,0.59201,0.55191,0.22628,0.67042
154,Benin,Sub-Saharan Africa,155,3.340,0.03656,0.28665,0.35386,0.31910,0.48450,0.08010,0.18260,1.63328
155,Syria,Middle East and Northern Africa,156,3.006,0.05015,0.66320,0.47489,0.72193,0.15684,0.18906,0.47179,0.32858
156,Burundi,Sub-Saharan Africa,157,2.905,0.08658,0.01530,0.41587,0.22396,0.11850,0.10062,0.19727,1.83302
157,Togo,Sub-Saharan Africa,158,2.839,0.06727,0.20868,0.13995,0.28443,0.36453,0.10731,0.16681,1.56726

In [53]:
f=e[["Freedom","Trust (Government Corruption)"]]
f

     Freedom  Trust (Government Corruption)
0    0.66557                        0.41978
1    0.62877                        0.14145
2    0.64938                        0.48357
3    0.66973                        0.36503
4    0.63297                        0.32957
..       ...                            ...
153  0.59201                        0.55191
154  0.48450                        0.08010
155  0.15684                        0.18906
156  0.11850                        0.10062
157  0.36453                        0.10731

[158 rows x 2 columns]

In [54]:
f.mean()

Freedom                          0.428615
Trust (Government Corruption)    0.143422
dtype: float64

In [55]:
f.median()

Freedom                          0.435515
Trust (Government Corruption)    0.107220
dtype: float64

In [56]:
f.mode()

     Freedom  Trust (Government Corruption)
0    0.00000                        0.32524
1    0.07699                            NaN
2    0.09245                            NaN
3    0.10081                            NaN
4    0.10384                            NaN
..       ...                            ...
153  0.65821                            NaN
154  0.65980                            NaN
155  0.66246                            NaN
156  0.66557                            NaN
157  0.66973                            NaN

[158 rows x 2 columns]

In [57]:
f.describe()

          Freedom  Trust (Government Corruption)
count  158.000000                     158.000000
mean     0.428615                       0.143422
std      0.150693                       0.120034
min      0.000000                       0.000000
25%      0.328330                       0.061675
50%      0.435515                       0.107220
75%      0.549092                       0.180255
max      0.669730                       0.551910

In [58]:
f.sum()

Freedom                          67.72116
Trust (Government Corruption)    22.66065
dtype: float64

In [59]:
f.cumsum()

      Freedom  Trust (Government Corruption)
0     0.66557                        0.41978
1     1.29434                        0.56123
2     1.94372                        1.04480
3     2.61345                        1.40983
4     3.24642                        1.73940
..        ...                            ...
153  66.59679                       22.18356
154  67.08129                       22.26366
155  67.23813                       22.45272
156  67.35663                       22.55334
157  67.72116                       22.66065

[158 rows x 2 columns]

In [60]:
f.count()

Freedom                          158
Trust (Government Corruption)    158
dtype: int64

In [61]:
f.min()

Freedom                          0.0
Trust (Government Corruption)    0.0
dtype: float64

In [62]:
f.max()

Freedom                          0.66973
Trust (Government Corruption)    0.55191
dtype: float64

In [64]:
data_1=f["Freedom"]
data_2=f["Trust (Government Corruption)"]
print(cov(data_1,data_2))

[[0.02270832 0.00892699]
 [0.00892699 0.01440818]]

In [65]:
print(spearmanr(data_1,data_2))

SpearmanrResult(correlation=0.4637454296249126, pvalue=8.43601126800965e-10)

In [66]:
print(pearsonr(data_1,data_2))

(0.49352351748290535, 4.4399838921844506e-11)

# DataSet 4

In [67]:
g=pd.read_csv(r"E:\Python Data Science\Documents\fiat500_VehicleSelection_Dataset - fiat500_VehicleSelection_Dataset.csv")
g

,ID,model,engine_power,age_in_days,km,previous_owners,lat,lon,price,Unnamed: 9,Unnamed: 10
0,1.0,lounge,51.0,882.0,25000.0,1.0,44.907242,8.611559868,8900,NaN,NaN
1,2.0,pop,51.0,1186.0,32500.0,1.0,45.666359,12.24188995,8800,NaN,NaN
2,3.0,sport,74.0,4658.0,142228.0,1.0,45.503300,11.41784,4200,NaN,NaN
3,4.0,lounge,51.0,2739.0,160000.0,1.0,40.633171,17.63460922,6000,NaN,NaN
4,5.0,pop,73.0,3074.0,106880.0,1.0,41.903221,12.49565029,5700,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
1544,NaN,NaN,NaN,NaN,NaN,NaN,NaN,length,5,NaN,NaN
1545,NaN,NaN,NaN,NaN,NaN,NaN,NaN,concat,lonprice,NaN,NaN
1546,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Null values,NO,NaN,NaN
1547,NaN,NaN,NaN,NaN,NaN,NaN,NaN,find,1,NaN,NaN
1548,NaN,NaN,NaN,NaN,NaN,NaN,NaN,search,1,NaN,NaN

In [68]:
h=g[["age_in_days","km"]]
h

      age_in_days        km
0           882.0   25000.0
1          1186.0   32500.0
2          4658.0  142228.0
3          2739.0  160000.0
4          3074.0  106880.0
...           ...       ...
1544          NaN       NaN
1545          NaN       NaN
1546          NaN       NaN
1547          NaN       NaN
1548          NaN       NaN

[1549 rows x 2 columns]

In [69]:
i=h.fillna(value=15)
i

      age_in_days        km
0           882.0   25000.0
1          1186.0   32500.0
2          4658.0  142228.0
3          2739.0  160000.0
4          3074.0  106880.0
...           ...       ...
1544         15.0      15.0
1545         15.0      15.0
1546         15.0      15.0
1547         15.0      15.0
1548         15.0      15.0

[1549 rows x 2 columns]

In [70]:
i.mean()

age_in_days     1639.362815
km             53016.934151
dtype: float64

In [71]:
i.median()

age_in_days     1035.0
km             38800.0
dtype: float64

In [72]:
i.mode()

   age_in_days       km
0        366.0  17000.0
1        790.0      NaN

In [73]:
i.describe()

       age_in_days             km
count  1549.000000    1549.000000
mean   1639.362815   53016.934151
std    1292.259640   40155.414665
min      15.000000      15.000000
25%     670.000000   19956.000000
50%    1035.000000   38800.000000
75%    2616.000000   79000.000000
max    4658.000000  235000.000000

In [74]:
i.sum()

age_in_days     2539373.0
km             82123231.0
dtype: float64

In [75]:
i.cumsum()

      age_in_days          km
0           882.0     25000.0
1          2068.0     57500.0
2          6726.0    199728.0
3          9465.0    359728.0
4         12539.0    466608.0
...           ...         ...
1544    2539313.0  82123171.0
1545    2539328.0  82123186.0
1546    2539343.0  82123201.0
1547    2539358.0  82123216.0
1548    2539373.0  82123231.0

[1549 rows x 2 columns]

In [76]:
i.count()

age_in_days    1549
km             1549
dtype: int64

In [77]:
i.min()

age_in_days    15.0
km             15.0
dtype: float64

In [78]:
i.max()

age_in_days      4658.0
km             235000.0
dtype: float64

In [80]:
d_1=i["age_in_days"]
d_2=i["km"]
print(cov(d_1,d_2))

[[1.66993498e+06 4.33732802e+07]
 [4.33732802e+07 1.61245733e+09]]

In [81]:
print(spearmanr(d_1,d_2))

SpearmanrResult(correlation=0.837737856976292, pvalue=0.0)

In [82]:
print(pearsonr(d_1,d_2))

(0.8358500483231861, 0.0)

# DataSet 5

In [83]:
j=pd.read_csv(r"E:\Python Data Science\Documents\USA_Housing.csv")
j

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price,Address
0,79545.458574,5.682861,7.009188,4.09,23086.800503,1.059034e+06,"208 Michael Ferry Apt. 674\nLaurabury, NE 3701..."
1,79248.642455,6.002900,6.730821,3.09,40173.072174,1.505891e+06,"188 Johnson Views Suite 079\nLake Kathleen, CA..."
2,61287.067179,5.865890,8.512727,5.13,36882.159400,1.058988e+06,"9127 Elizabeth Stravenue\nDanieltown, WI 06482..."
3,63345.240046,7.188236,5.586729,3.26,34310.242831,1.260617e+06,USS Barnett\nFPO AP 44820
4,59982.197226,5.040555,7.839388,4.23,26354.109472,6.309435e+05,USNS Raymond\nFPO AE 09386
...,...,...,...,...,...,...,...
4995,60567.944140,7.830362,6.137356,3.46,22837.361035,1.060194e+06,USNS Williams\nFPO AP 30153-7653
4996,78491.275435,6.999135,6.576763,4.02,25616.115489,1.482618e+06,"PSC 9258, Box 8489\nAPO AA 42991-3352"
4997,63390.686886,7.250591,4.805081,2.13,33266.145490,1.030730e+06,"4215 Tracy Garden Suite 076\nJoshualand, VA 01..."
4998,68001.331235,5.534388,7.130144,5.44,42625.620156,1.198657e+06,USS Wallace\nFPO AE 73316
4999,65510.581804,5.992305,6.792336,4.07,46501.283803,1.298950e+06,"37778 George Ridges Apt. 509\nEast Holly, NV 2..."

In [84]:
k=j[["Avg. Area House Age","Avg. Area Number of Rooms"]]
k

      Avg. Area House Age  Avg. Area Number of Rooms
0                5.682861                   7.009188
1                6.002900                   6.730821
2                5.865890                   8.512727
3                7.188236                   5.586729
4                5.040555                   7.839388
...                   ...                        ...
4995             7.830362                   6.137356
4996             6.999135                   6.576763
4997             7.250591                   4.805081
4998             5.534388                   7.130144
4999             5.992305                   6.792336

[5000 rows x 2 columns]

In [85]:
k.mean()

Avg. Area House Age          5.977222
Avg. Area Number of Rooms    6.987792
dtype: float64

In [86]:
k.median()

Avg. Area House Age          5.970429
Avg. Area Number of Rooms    7.002902
dtype: float64

In [87]:
k.mode()

      Avg. Area House Age  Avg. Area Number of Rooms
0                2.644304                   3.236194
1                2.683043                   3.950225
2                2.797215                   3.950973
3                2.797619                   3.969632
4                2.922736                   4.027931
...                   ...                        ...
4995             8.973441                  10.024375
4996             8.991399                  10.144988
4997             9.008900                  10.219902
4998             9.125283                  10.280022
4999             9.519088                  10.759588

[5000 rows x 2 columns]

In [88]:
k.describe()

       Avg. Area House Age  Avg. Area Number of Rooms
count          5000.000000                5000.000000
mean              5.977222                   6.987792
std               0.991456                   1.005833
min               2.644304                   3.236194
25%               5.322283                   6.299250
50%               5.970429                   7.002902
75%               6.650808                   7.665871
max               9.519088                  10.759588

In [89]:
k.sum()

Avg. Area House Age          29886.110176
Avg. Area Number of Rooms    34938.959255
dtype: float64

In [90]:
k.cumsum()

      Avg. Area House Age  Avg. Area Number of Rooms
0                5.682861                   7.009188
1               11.685761                  13.740009
2               17.551651                  22.252737
3               24.739887                  27.839465
4               29.780442                  35.678853
...                   ...                        ...
4995         29860.333757               34913.654931
4996         29867.332892               34920.231694
4997         29874.583483               34925.036775
4998         29880.117871               34932.166918
4999         29886.110176               34938.959255

[5000 rows x 2 columns]

In [91]:
k.count()

Avg. Area House Age          5000
Avg. Area Number of Rooms    5000
dtype: int64

In [92]:
k.min()

Avg. Area House Age          2.644304
Avg. Area Number of Rooms    3.236194
dtype: float64

In [93]:
k.max()

Avg. Area House Age           9.519088
Avg. Area Number of Rooms    10.759588
dtype: float64

In [95]:
r1=k["Avg. Area House Age"]
r2=k["Avg. Area Number of Rooms"]
print(cov(r1,r2))

[[ 0.98298536 -0.00940227]
 [-0.00940227  1.01170049]]

In [96]:
print(spearmanr(r1,r2))

SpearmanrResult(correlation=-0.0051978531999141275, pvalue=0.7132801669661967)

In [97]:
print(pearsonr(r1,r2))

(-0.009428292244463858, 0.5050729943851315)